[
  {
    "word": "abundant",
    "definition": "present in great quantity",
    "usage": {
      "sentence": "Markets in the city were booming with abundant supplies of dried, fresh, and processed foods, including milled rice, tofu, crackers, cakes, and meat.",
      "source": "Escape from Camp 14: One Man's Remarkable Odyssey from North Korea to Freedom in the West"
    }
  },
  {
    "word": "authentic",
    "definition": "not counterfeit or copied",
    "usage": {
      "sentence": "The would-be seller says he believes his sword is authentic, and the Cincinnati sword was a copy.",
      "source": "Washington Times (Nov 6, 2019)"
    }
  },
  {
    "word": "dedicate",
    "definition": "give entirely to a specific person, activity, or cause",
    "usage": {
      "sentence": "In order not to become bored, he dedicated himself to the task of repairing the many things that needed fixing in the house.",
      "source": "One Hundred Years of Solitude"
    }
  },
  {
    "word": "efficient",
    "definition": "being effective without wasting time, effort, or expense",
    "usage": {
      "sentence": "She could easily spend less time on housework if she pushed herself to be faster and more efficient.",
      "source": "Homecoming"
    }
  },
  {
    "word": "forfeit",
    "definition": "lose the right to or lose by some error, offense, or crime",
    "usage": {
      "sentence": "It meant the princess would become an ordinary citizen as female imperial family members forfeit their royal status upon marriage to a commoner.",
      "source": "BBC (Oct 26, 2021)"
    }
  },
  {
    "word": "intention",
    "definition": "a wish or design that you plan to carry out",
    "usage": {
      "sentence": "I start to guzzle down the water, with no intention of sharing, because I know these kids have water of their own.",
      "source": "Dry"
    }
  },
  {
    "word": "loathe",
    "definition": "dislike intensely; feel disgust toward",
    "usage": {
      "sentence": "The colonel had never liked the chaplain and now he loathed and distrusted him.",
      "source": "Catch-22"
    }
  },
  {
    "word": "makeshift",
    "definition": "done or made using whatever is available",
    "usage": {
      "sentence": "The room was mostly taken up by a makeshift desk—an old warehouse door atop stacked fruit crates—piled high with papers.",
      "source": "Six of Crows"
    }
  },
  {
    "word": "meager",
    "definition": "deficient in amount or quality or extent",
    "usage": {
      "sentence": "Usually there was a good supply of salt fish kept in barrels, but fish had not been plentiful the past summer, so now the supply was meager.",
      "source": "The Door in the Wall"
    }
  },
  {
    "word": "perceive",
    "definition": "become aware of through the senses",
    "usage": {
      "sentence": "When Hazel woke he perceived at once that it was morning—some time after sunrise, by the smell of it.",
      "source": "Watership Down: A Novel"
    }
  },
  {
    "word": "prominent",
    "definition": "conspicuous in position or importance",
    "usage": {
      "sentence": "No one there knew he was a prominent doctor of sociology, with years of experience as a college professor and several well-respected books.",
      "source": "Tuesdays with Morrie"
    }
  },
  {
    "word": "rigorous",
    "definition": "strict; allowing no deviation from a standard",
    "usage": {
      "sentence": "He measured himself and those around him by an impossibly rigorous moral code.",
      "source": "Into the Wild"
    }
  },
  {
    "word": "stealthy",
    "definition": "marked by quiet and caution and secrecy",
    "usage": {
      "sentence": "But Cristiana surprised me by appearing at my side in her stealthy way.",
      "source": "Ophelia"
    }
  },
  {
    "word": "unanimous",
    "definition": "in complete agreement",
    "usage": {
      "sentence": "However you decide, your verdict must be unanimous.",
      "source": "Twelve Angry Men"
    }
  },
  {
    "word": "verify",
    "definition": "confirm the truth of",
    "usage": {
      "sentence": "Luma took the player cards to Tracy—the referee would need them to verify the identities and ages of the players.",
      "source": "Outcasts United: An American Town, a Refugee Team, and One Woman's Quest to Make a Difference"
    }
  },
  {
    "word": "accumulate",
    "definition": "get or gather together",
    "usage": {
      "sentence": "It had taken her years to save five dollars, she had hoarded pennies to accumulate such a sum.",
      "source": "Harriet Tubman: Conductor on the Underground Railroad"
    }
  },
  {
    "word": "beneficial",
    "definition": "promoting or enhancing well-being",
    "usage": {
      "sentence": "Regular exercise also activates the body and this is beneficial for the brain.",
      "source": "The Guardian (Oct 14, 2018)"
    }
  },
  {
    "word": "complexity",
    "definition": "the quality of being intricate and compounded",
    "usage": {
      "sentence": "Maps are not accurate portraits of the world in all of its complexity.",
      "source": "Scientific American (Jan 14, 2020)"
    }
  },
  {
    "word": "diverge",
    "definition": "extend in a different direction",
    "usage": {
      "sentence": "Once, when the road diverged, Tristran was concerned that they might take the wrong fork.",
      "source": "Stardust"
    }
  },
  {
    "word": "evade",
    "definition": "escape, either physically or mentally",
    "usage": {
      "sentence": "It’s a wonder you’ve evaded the government for so long—but you can’t hide now, not when your own family or friends are at risk.",
      "source": "Legend"
    }
  },
  {
    "word": "fatigue",
    "definition": "exhaust or get tired through overuse or great strain",
    "usage": {
      "sentence": "He was fatigued, but pleasantly so, as if he had worked hard at some extremely enjoyable task.",
      "source": "The Mysterious Benedict Society"
    }
  },
  {
    "word": "haste",
    "definition": "overly eager speed and possible carelessness",
    "usage": {
      "sentence": "I jumped out of bed and began to dress, in great haste, without bothering to shave or even comb my hair.",
      "source": "The Secret History"
    }
  },
  {
    "word": "interpret",
    "definition": "make sense of; assign a meaning to",
    "usage": {
      "sentence": "The look on her face was far from friendly, and Shirley did not need a lesson in reading faces to interpret its meaning.",
      "source": "In the Year of the Boar and Jackie Robinson"
    }
  },
  {
    "word": "mischievous",
    "definition": "naughtily or annoyingly playful",
    "usage": {
      "sentence": "“I love her mischievous eyes, her playfulness. She has a very positive spirit as a person.”",
      "source": "New York Times (Oct 21, 2021)"
    }
  },
  {
    "word": "persevere",
    "definition": "be persistent, refuse to stop",
    "usage": {
      "sentence": "In his first week on the trail, he managed just five miles a day, but he persevered, and by August, when he reached his home state, he was up to a dozen miles a day.",
      "source": "A Walk in the Woods"
    }
  },
  {
    "word": "pulverize",
    "definition": "make into a powder by breaking up or cause to become dust",
    "usage": {
      "sentence": "Weakened by sunlight and pulverized by winds and waves, those plastic products fracture into ever-smaller pieces.",
      "source": "Scientific American (Aug 13, 2018)"
    }
  },
  {
    "word": "refrain",
    "definition": "resist doing something",
    "usage": {
      "sentence": "I know I have my own feelings as to who should be chosen as the leader, but I’ll refrain from saying at this time so as not to influence any decisions.",
      "source": "The Maze Runner"
    }
  },
  {
    "word": "reminisce",
    "definition": "recall the past",
    "usage": {
      "sentence": "They reminisced about past Christmases, or, as Francie put it, they talked about olden times.",
      "source": "A Tree Grows in Brooklyn"
    }
  },
  {
    "word": "solitude",
    "definition": "the state or situation of being alone",
    "usage": {
      "sentence": "Silence and solitude: she might have been alone in the world.",
      "source": "Homecoming"
    }
  },
  {
    "word": "treacherous",
    "definition": "dangerously unstable and unpredictable",
    "usage": {
      "sentence": "The ice seemed a treacherous thing to walk on.",
      "source": "Breadcrumbs"
    }
  },
  {
    "word": "acquire",
    "definition": "come into the possession of something concrete or abstract",
    "usage": {
      "sentence": "The important thing, the reason he and Mom had decided to acquire this particular piece of property, was that it came with plenty of land to build our new house.",
      "source": "The Glass Castle"
    }
  },
  {
    "word": "adapt",
    "definition": "conform oneself to new or different conditions",
    "usage": {
      "sentence": "Always consider how you might adapt to your surroundings rather than forcing your surroundings to adapt to you.",
      "source": "Aru Shah and the End of Time"
    }
  },
  {
    "word": "consecutive",
    "definition": "one after the other",
    "usage": {
      "sentence": "It was the third consecutive night of fighting between the enemies.",
      "source": "Seattle Times (Sep 12, 2021)"
    }
  },
  {
    "word": "determined",
    "definition": "characterized by great firmness of purpose",
    "usage": {
      "sentence": "In the morning I was stiff and sore and starving—but I was alive, and more determined than ever to finish what I’d started.",
      "source": "The Honest Truth"
    }
  },
  {
    "word": "elaborate",
    "definition": "marked by complexity and richness of detail",
    "usage": {
      "sentence": "The streets are crowded with young people in elaborate getups—giant lace skirts, elaborate umbrellas, ten-inch-tall boots, eyelashes that seem miles long, face masks that glow in the dark.",
      "source": "Warcross"
    }
  },
  {
    "word": "excel",
    "definition": "distinguish oneself",
    "usage": {
      "sentence": "The man who had succeeded his entire life, excelling at everything and failing at nothing, was beaten.",
      "source": "Lincoln's Last Days: The Shocking Assassination that Changed America Forever"
    }
  },
  {
    "word": "hypothesis",
    "definition": "a tentative insight that is not yet verified or tested",
    "usage": {
      "sentence": "A hypothesis is a tentative explanation, a proposed answer to the question that underlies your research.",
      "source": "The Thing About Jellyfish"
    }
  },
  {
    "word": "intricate",
    "definition": "having many complexly arranged elements; elaborate",
    "usage": {
      "sentence": "The machine was so intricate, so complicated, that he almost got dizzy looking at it.",
      "source": "The Invention of Hugo Cabret"
    }
  },
  {
    "word": "mournful",
    "definition": "expressing sorrow",
    "usage": {
      "sentence": "Sitting down on the ice, he raised his head and howled the most mournful cry I had ever heard.",
      "source": "Where the Red Fern Grows"
    }
  },
  {
    "word": "optimistic",
    "definition": "hopeful that the best will happen in the future",
    "usage": {
      "sentence": "I had some seed potatoes left; they looked pretty dried up, but I felt so optimistic and energetic I planted them anyway.",
      "source": "Z for Zachariah"
    }
  },
  {
    "word": "reassure",
    "definition": "cause to feel confident",
    "usage": {
      "sentence": "Dr. Javid reassured him that I would be taken care of.",
      "source": "Malala: The Girl Who Stood Up for Education and Changed the World"
    }
  },
  {
    "word": "sabotage",
    "definition": "a deliberate act of destruction or disruption",
    "usage": {
      "sentence": "A computer virus was the perfect piece of sabotage: invisible and instantaneous.",
      "source": "Stormbreaker"
    }
  },
  {
    "word": "serene",
    "definition": "not agitated",
    "usage": {
      "sentence": "She floated, serene and at peace, on a black sea that knew no shore.",
      "source": "A Game of Thrones"
    }
  },
  {
    "word": "sufficient",
    "definition": "of a quantity that can fulfill a need or requirement",
    "usage": {
      "sentence": "After that every Wednesday a delivery boy brought a basket of food that was quite sufficient for a week.",
      "source": "One Hundred Years of Solitude"
    }
  },
  {
    "word": "waver",
    "definition": "be unsure or weak",
    "usage": {
      "sentence": "He tried to sound brave, but his voice wavered.",
      "source": "The Assassination of Brangwain Spurge"
    }
  },
  {
    "word": "adequate",
    "definition": "sufficient for the purpose",
    "usage": {
      "sentence": "I need adequate rest to do well in school.",
      "source": "Washington Post (Mar 28, 2021)"
    }
  },
  {
    "word": "contemplate",
    "definition": "reflect deeply on a subject",
    "usage": {
      "sentence": "Coach Douglas stepped out, leaving Reggie to contemplate what he would do if he were rich and powerful.",
      "source": "The Parker Inheritance"
    }
  },
  {
    "word": "devastate",
    "definition": "cause extensive destruction or ruin utterly",
    "usage": {
      "sentence": "Agricultural societies are ravaged by famine when drought, fire or earthquake devastates the annual rice or potato crop.",
      "source": "Sapiens: A Brief History of Humankind"
    }
  },
  {
    "word": "evaluate",
    "definition": "estimate the nature, quality, ability or significance of",
    "usage": {
      "sentence": "The US government is required to consider new science in evaluating whether air pollution rules are strong enough every five years.",
      "source": "The Guardian (Apr 14, 2020)"
    }
  },
  {
    "word": "factor",
    "definition": "anything that contributes causally to a result",
    "usage": {
      "sentence": "There are multiple factors that determine how long herbs will stay perky, vibrant, and fresh.",
      "source": "Salon (Jan 12, 2021)"
    }
  },
  {
    "word": "immature",
    "definition": "childish in behavior or emotional development",
    "usage": {
      "sentence": "Sometimes like immature kids, we argued, we fought, we bantered or insulted each other.",
      "source": "Washington Times (Feb 24, 2020)"
    }
  },
  {
    "word": "interject",
    "definition": "speak abruptly, especially as an interruption",
    "usage": {
      "sentence": "I tried to interject, but I couldn’t get a word in.",
      "source": "Tristan Strong Punches a Hole in the Sky"
    }
  },
  {
    "word": "linger",
    "definition": "remain present although waning or gradually dying",
    "usage": {
      "sentence": "It’s woodsy and shaded, and the dampness of winter still lingers.",
      "source": "A Heart in a Body in the World"
    }
  },
  {
    "word": "nurture",
    "definition": "help develop; help grow",
    "usage": {
      "sentence": "It’s great to set goals and nurture hope.",
      "source": "Washington Post (Feb 24, 2021)"
    }
  },
  {
    "word": "precision",
    "definition": "the quality of being exact",
    "usage": {
      "sentence": "His strong, skilled fingers shaped the signs with loving precision.",
      "source": "The Heart is a Lonely Hunter"
    }
  },
  {
    "word": "rebellion",
    "definition": "organized opposition to authority",
    "usage": {
      "sentence": "There were more soldiers there, standing with rifles at the ready, waiting for some outbreak of rebellion.",
      "source": "Dragonwings"
    }
  },
  {
    "word": "repetition",
    "definition": "the continued use of the same word or word pattern",
    "usage": {
      "sentence": "It occurred to Calder that there could be hidden information here—after all, codes involved repetition, and the same objects appeared again and again in Vermeer’s work.",
      "source": "Chasing Vermeer"
    }
  },
  {
    "word": "shrill",
    "definition": "having or emitting a high-pitched and sharp tone or tones",
    "usage": {
      "sentence": "Every now and then it cawed, a loud, shrill cry that made me flinch.",
      "source": "Tristan Strong Punches a Hole in the Sky"
    }
  },
  {
    "word": "symbol",
    "definition": "something visible that represents something invisible",
    "usage": {
      "sentence": "In the ballet, the swan is a symbol of faithfulness.",
      "source": "The Guardian (Jun 14, 2010)"
    }
  },
  {
    "word": "unique",
    "definition": "the single one of its kind",
    "usage": {
      "sentence": "She is completely her own unique self and doesn’t care what anyone thinks.",
      "source": "Insignificant Events in the Life of a Cactus"
    }
  },
  {
    "word": "apparent",
    "definition": "clearly revealed to the mind or the senses or judgment",
    "usage": {
      "sentence": "By midday Jonas’s absence would become apparent, and would be a cause for serious concern.",
      "source": "The Giver"
    }
  },
  {
    "word": "chronological",
    "definition": "relating to or arranged according to the order of time",
    "usage": {
      "sentence": "The book is split into five parts, which proceed roughly in reverse chronological order, beginning in the nineteen-forties and stretching back to the eighteenth century.",
      "source": "The New Yorker (Oct 9, 2019)"
    }
  },
  {
    "word": "commotion",
    "definition": "the act of making a noisy disturbance",
    "usage": {
      "sentence": "You wouldn’t believe the amount of chaos and commotion six brothers could create.",
      "source": "The Evolution of Calpurnia Tate"
    }
  },
  {
    "word": "controversy",
    "definition": "a dispute where there is strong disagreement",
    "usage": {
      "sentence": "To be most effective, she felt, her actions must be seen as a response to an important national issue, not just a local controversy.",
      "source": "The Voice That Challenged a Nation: Marian Anderson and the Struggle for Equal Rights"
    }
  },
  {
    "word": "diminish",
    "definition": "decrease in size, extent, or range",
    "usage": {
      "sentence": "I was concerned that he would diminish his impact, rather than increase it.",
      "source": "New York Times (Jan 30, 2020)"
    }
  },
  {
    "word": "flammable",
    "definition": "easily ignited",
    "usage": {
      "sentence": "Around your home, move flammable materials like dried leaves and needles, gas and propane containers and firewood away from all structures.",
      "source": "Salon (Jul 1, 2021)"
    }
  },
  {
    "word": "frigid",
    "definition": "extremely cold",
    "usage": {
      "sentence": "A sudden blast of frigid air hits us from the east, and she shivers.",
      "source": "Things Not Seen"
    }
  },
  {
    "word": "impair",
    "definition": "make worse or less effective",
    "usage": {
      "sentence": "There is no atmosphere surrounding the moon to produce clouds or smog, so our view was impaired only by darkness.",
      "source": "Flying to the Moon: An Astronaut's Story"
    }
  },
  {
    "word": "prediction",
    "definition": "a statement made about the future",
    "usage": {
      "sentence": "Osh was known for such predictions, most of which came true.",
      "source": "Beyond the Bright Sea"
    }
  },
  {
    "word": "prejudice",
    "definition": "a partiality preventing objective consideration of an issue",
    "usage": {
      "sentence": "Now I discovered that there was inequality and prejudice in this country that I had already come to love.",
      "source": "The Boy on the Wooden Box"
    }
  },
  {
    "word": "represent",
    "definition": "express indirectly by an image, form, or model",
    "usage": {
      "sentence": "Each number represented something different: the six, a ship; the five, a captain; and the four, a crew.",
      "source": "The Reader"
    }
  },
  {
    "word": "stern",
    "definition": "serious and harsh in manner or behavior",
    "usage": {
      "sentence": "Connor gave me a stern look, like he was my dad.",
      "source": "Insignificant Events in the Life of a Cactus"
    }
  },
  {
    "word": "sympathetic",
    "definition": "expressing compassion or friendly fellow feelings",
    "usage": {
      "sentence": "She was nice enough—frank, sincere, and sympathetic.",
      "source": "Red Scarf Girl: A Memoir of the Cultural Revolution"
    }
  },
  {
    "word": "unruly",
    "definition": "unable to be governed or controlled",
    "usage": {
      "sentence": "Most of the windows on the second floor had been broken by unruly students or in after-hours fights.",
      "source": "Anger Is a Gift"
    }
  },
  {
    "word": "variable",
    "definition": "marked by diversity or difference",
    "usage": {
      "sentence": "Their height is variable, ranging between two and four feet of our measure.",
      "source": "The Fellowship of the Ring"
    }
  },
  {
    "word": "appease",
    "definition": "cause to be more favorably inclined; gain the good will of",
    "usage": {
      "sentence": "In order to have a certain type of success, you’re told you have to appease and pacify the audience.",
      "source": "New York Times (Aug 12, 2018)"
    }
  },
  {
    "word": "arrogant",
    "definition": "having or showing feelings of unwarranted importance",
    "usage": {
      "sentence": "I don't care whether people think I'm smug and arrogant.",
      "source": "The Guardian (Jul 17, 2010)"
    }
  },
  {
    "word": "cultivate",
    "definition": "foster the growth of",
    "usage": {
      "sentence": "The leaders of the group clearly valued and cultivated the talent of their female members.",
      "source": "Hidden Figures"
    }
  },
  {
    "word": "distinguish",
    "definition": "mark as different",
    "usage": {
      "sentence": "The main building was called “the house,” to distinguish it from the cottages.",
      "source": "The Awakening"
    }
  },
  {
    "word": "exempt",
    "definition": "freed from or not subject to an obligation or liability",
    "usage": {
      "sentence": "Only children and those who have medical reasons for not being vaccinated are exempt from the new rule.",
      "source": "The Guardian (Nov 16, 2021)"
    }
  },
  {
    "word": "frustration",
    "definition": "a feeling of annoyance at being hindered or criticized",
    "usage": {
      "sentence": "She frowns deeply, shaking her head in frustration.",
      "source": "Water for Elephants"
    }
  },
  {
    "word": "inevitable",
    "definition": "incapable of being avoided or prevented",
    "usage": {
      "sentence": "They shivered at the thought of their inevitable fate.",
      "source": "Redwall"
    }
  },
  {
    "word": "lurch",
    "definition": "move haltingly and unsteadily",
    "usage": {
      "sentence": "The minivan lurched to a stop, throwing all four of us forward.",
      "source": "The Darkest Minds"
    }
  },
  {
    "word": "overwhelm",
    "definition": "overcome, as with emotions or perceptual stimuli",
    "usage": {
      "sentence": "The blackness of the sea suddenly overwhelmed her; it was nothing more than a vast emptiness.",
      "source": "When the Sea Turned to Silver"
    }
  },
  {
    "word": "reckless",
    "definition": "marked by defiant disregard for danger or consequences",
    "usage": {
      "sentence": "It had been reckless and foolish, and yet it had felt good to speak my mind.",
      "source": "The Lions of Little Rock"
    }
  },
  {
    "word": "recoil",
    "definition": "draw back, as with fear or pain",
    "usage": {
      "sentence": "The cold, slimy thing grazed Sheed’s thumb, causing him to recoil and squeal.",
      "source": "The Last Last-Day-of-Summer"
    }
  },
  {
    "word": "resolve",
    "definition": "bring to an end; settle conclusively",
    "usage": {
      "sentence": "The problems that remain are serious and must be resolved through negotiations.",
      "source": "New York Times (May 6, 2021)"
    }
  },
  {
    "word": "spacious",
    "definition": "having ample room",
    "usage": {
      "sentence": "We stepped into the kitchen, a large spacious room.",
      "source": "The Bluest Eye"
    }
  },
  {
    "word": "tentative",
    "definition": "hesitant or lacking confidence; unsettled in mind or opinion",
    "usage": {
      "sentence": "Her gestures were slow and tentative and her eyes reflected deep mental confusion.",
      "source": "Life of Pi"
    }
  },
  {
    "word": "urgent",
    "definition": "compelling immediate action",
    "usage": {
      "sentence": "Out of the way! Out of the way! This is urgent!",
      "source": "Lucky Broken Girl"
    }
  },
  {
    "word": "circumstance",
    "definition": "a condition that accompanies some event or activity",
    "usage": {
      "sentence": "He wondered how things might have turned out differently for him if he’d had more faith, a different name, or been born to different circumstances.",
      "source": "The Serpent King"
    }
  },
  {
    "word": "commence",
    "definition": "begin or get started",
    "usage": {
      "sentence": "We passed a few sad hours until eleven o’clock, when the trial was to commence.",
      "source": "Frankenstein"
    }
  },
  {
    "word": "current",
    "definition": "occurring in or belonging to the present time",
    "usage": {
      "sentence": "Former Emperor Akihito, the father of the current emperor, was the first member of the imperial family to marry a commoner.",
      "source": "Seattle Times (Nov 13, 2021)"
    }
  },
  {
    "word": "desperate",
    "definition": "showing extreme urgency or intensity because of great need",
    "usage": {
      "sentence": "Was I so desperate to survive that I would steal bread from a sick boy?",
      "source": "Prisoner B-3087"
    }
  },
  {
    "word": "extensive",
    "definition": "broad in scope or content",
    "usage": {
      "sentence": "My vocabulary is just not as extensive, and sometimes I get stuck.",
      "source": "I Am Not Your Perfect Mexican Daughter"
    }
  },
  {
    "word": "glum",
    "definition": "moody and sorrowful",
    "usage": {
      "sentence": "She looked glum after that, and I felt sorry that I’d crushed her hopes.",
      "source": "Made You Up"
    }
  },
  {
    "word": "grimace",
    "definition": "a contorted facial expression",
    "usage": {
      "sentence": "He stilled, then slowly curled into a ball, his face set in a fierce grimace of pain.",
      "source": "The Kill Order (Maze Runner, Book Four; Origin)"
    }
  },
  {
    "word": "inferior",
    "definition": "of or characteristic of low rank or importance",
    "usage": {
      "sentence": "The author, Mary Wollstonecraft, argued that women weren’t naturally inferior to men but lacked educational opportunities that allowed them to achieve equality.",
      "source": "Votes for Women!"
    }
  },
  {
    "word": "parched",
    "definition": "dried out by heat or excessive exposure to sunlight",
    "usage": {
      "sentence": "“Pa, try to take some water,” she’d say, lifting his head and holding a glass to his cracked, parched lips.",
      "source": "Cold Sassy Tree"
    }
  },
  {
    "word": "plummet",
    "definition": "drop sharply",
    "usage": {
      "sentence": "Then the rotten old floor collapsed, and the boys plummeted into the basement.",
      "source": "October Sky"
    }
  },
  {
    "word": "priority",
    "definition": "status established in order of importance or urgency",
    "usage": {
      "sentence": "Our highest priority is the health and safety of our fans, staff, and local community.",
      "source": "The Guardian (Aug 2, 2019)"
    }
  },
  {
    "word": "recount",
    "definition": "narrate or give a detailed account of",
    "usage": {
      "sentence": "As we rode, he recounted tale after tale of their bravery and cleverness.",
      "source": "Ella Enchanted"
    }
  },
  {
    "word": "recurring",
    "definition": "coming back",
    "usage": {
      "sentence": "His studies were also interrupted by recurring illness, which was to plague him all his life.",
      "source": "The Scientists"
    }
  },
  {
    "word": "rummage",
    "definition": "search haphazardly",
    "usage": {
      "sentence": "She bends down and rummages in one of the cupboards behind her desk until she pulls out a bag of pretzels.",
      "source": "The Benefits of Being an Octopus"
    }
  },
  {
    "word": "stable",
    "definition": "showing little if any change",
    "usage": {
      "sentence": "It’s surprisingly stable; it doesn’t really change over time.",
      "source": "Scientific American (Oct 27, 2021)"
    }
  },
  {
    "word": "terrain",
    "definition": "a piece of ground having specific characteristics",
    "usage": {
      "sentence": "The path is still pretty wide, wide enough for horses, but the terrain around us is getting rockier, the path twistier.",
      "source": "The Knife of Never Letting Go"
    }
  },
  {
    "word": "transmit",
    "definition": "serve as the medium for sending something",
    "usage": {
      "sentence": "Art, for Denes, is a way of ordering the world, of transmitting ideas, of offering other people new ways of looking and thinking.",
      "source": "Washington Post (Oct 24, 2019)"
    }
  },
  {
    "word": "viewpoint",
    "definition": "a mental position from which things are considered",
    "usage": {
      "sentence": "And this time I want you to come ready to speak up. I think your viewpoint is going to be particularly valuable.",
      "source": "The Benefits of Being an Octopus"
    }
  },
  {
    "word": "visibility",
    "definition": "capability of providing a clear unobstructed view",
    "usage": {
      "sentence": "Snow begins, thick and wet, making visibility even more difficult.",
      "source": "Catching Fire"
    }
  },
  {
    "word": "wither",
    "definition": "shrink, as with a loss of moisture",
    "usage": {
      "sentence": "Flowers withered, insects shriveled, and fish died in their tanks.",
      "source": "Artemis Fowl"
    }
  }
]